; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	satellite5 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	satellite6 - satellite
	instrument13 - instrument
	instrument14 - instrument
	satellite7 - satellite
	instrument15 - instrument
	instrument16 - instrument
	instrument17 - instrument
	spectrograph2 - mode
	spectrograph3 - mode
	infrared0 - mode
	infrared4 - mode
	thermograph1 - mode
	GroundStation3 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	Star2 - direction
	GroundStation6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 Star2)
	(supports instrument1 spectrograph3)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 spectrograph2)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument3 spectrograph2)
	(supports instrument3 thermograph1)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 infrared0)
	(supports instrument4 thermograph1)
	(supports instrument4 infrared4)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
	(supports instrument5 spectrograph3)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 Star2)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
	(supports instrument6 spectrograph2)
	(supports instrument6 infrared0)
	(calibration_target instrument6 GroundStation6)
	(calibration_target instrument6 Star2)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 GroundStation1)
	(calibration_target instrument7 GroundStation4)
	(supports instrument8 spectrograph3)
	(supports instrument8 spectrograph2)
	(calibration_target instrument8 GroundStation4)
	(calibration_target instrument8 GroundStation0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation6)
	(supports instrument9 thermograph1)
	(supports instrument9 spectrograph3)
	(supports instrument9 infrared0)
	(calibration_target instrument9 Star2)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation6)
	(supports instrument10 infrared0)
	(supports instrument10 spectrograph2)
	(calibration_target instrument10 GroundStation3)
	(calibration_target instrument10 GroundStation5)
	(supports instrument11 infrared0)
	(calibration_target instrument11 Star2)
	(supports instrument12 spectrograph2)
	(calibration_target instrument12 GroundStation1)
	(calibration_target instrument12 GroundStation5)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation5)
	(supports instrument13 spectrograph3)
	(supports instrument13 infrared0)
	(supports instrument13 thermograph1)
	(calibration_target instrument13 GroundStation6)
	(calibration_target instrument13 GroundStation0)
	(supports instrument14 infrared4)
	(calibration_target instrument14 Star2)
	(calibration_target instrument14 GroundStation4)
	(on_board instrument13 satellite6)
	(on_board instrument14 satellite6)
	(power_avail satellite6)
	(pointing satellite6 GroundStation4)
	(supports instrument15 infrared0)
	(supports instrument15 thermograph1)
	(calibration_target instrument15 GroundStation1)
	(calibration_target instrument15 GroundStation6)
	(supports instrument16 thermograph1)
	(supports instrument16 infrared4)
	(calibration_target instrument16 Star2)
	(calibration_target instrument16 GroundStation4)
	(supports instrument17 spectrograph2)
	(supports instrument17 infrared0)
	(supports instrument17 infrared4)
	(calibration_target instrument17 GroundStation6)
	(on_board instrument15 satellite7)
	(on_board instrument16 satellite7)
	(on_board instrument17 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Star7)
)
(:goal (and
	(pointing satellite1 GroundStation3)
	(pointing satellite3 Star9)
	(pointing satellite4 Phenomenon10)
	(pointing satellite6 GroundStation5)
	(pointing satellite7 Phenomenon10)
	(have_image Star7 spectrograph2)
	(have_image Planet8 infrared0)
	(have_image Star9 thermograph1)
	(have_image Phenomenon10 infrared0)
	(have_image Planet11 infrared4)
))

)

; plan
1. (turn_to satellite7 groundstation6 star7)
   deleted: (pointing satellite7 star7)
   added: (pointing satellite7 groundstation6)
   goals met: 0 of 10
2. (switch_on instrument17 satellite7)
   deleted: (power_avail satellite7)
   added: (power_on instrument17)
   goals met: 0 of 10
3. (calibrate satellite7 instrument17 groundstation6)
   added: (calibrated instrument17)
   goals met: 0 of 10
4. (turn_to satellite7 planet11 groundstation6)
   deleted: (pointing satellite7 groundstation6)
   added: (pointing satellite7 planet11)
   goals met: 0 of 10
5. (turn_to satellite6 groundstation5 groundstation4)
   deleted: (pointing satellite6 groundstation4)
   added: (pointing satellite6 groundstation5)
   goals met: 1 of 10
6. (turn_to satellite4 phenomenon10 groundstation6)
   deleted: (pointing satellite4 groundstation6)
   added: (pointing satellite4 phenomenon10)
   goals met: 2 of 10
7. (turn_to satellite3 groundstation1 groundstation6)
   deleted: (pointing satellite3 groundstation6)
   added: (pointing satellite3 groundstation1)
   goals met: 2 of 10
8. (turn_to satellite1 groundstation3 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 groundstation3)
   goals met: 3 of 10
9. (take_image satellite7 planet11 instrument17 infrared4)
   added: (have_image planet11 infrared4)
   goals met: 4 of 10
10. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 4 of 10
11. (calibrate satellite3 instrument7 groundstation1)
   added: (calibrated instrument7)
   goals met: 4 of 10
12. (turn_to satellite3 star9 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 star9)
   goals met: 5 of 10
13. (take_image satellite3 star9 instrument7 thermograph1)
   added: (have_image star9 thermograph1)
   goals met: 6 of 10
14. (turn_to satellite7 planet8 planet11)
   deleted: (pointing satellite7 planet11)
   added: (pointing satellite7 planet8)
   goals met: 6 of 10
15. (take_image satellite7 planet8 instrument17 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 7 of 10
16. (turn_to satellite7 star7 planet8)
   deleted: (pointing satellite7 planet8)
   added: (pointing satellite7 star7)
   goals met: 7 of 10
17. (take_image satellite7 star7 instrument17 spectrograph2)
   added: (have_image star7 spectrograph2)
   goals met: 8 of 10
18. (turn_to satellite7 phenomenon10 star7)
   deleted: (pointing satellite7 star7)
   added: (pointing satellite7 phenomenon10)
   goals met: 9 of 10
19. (take_image satellite7 phenomenon10 instrument17 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 10 of 10
